<template>
  <v-card>
    <v-card-text>
      <no-ssr placeholder="エディターを読み込んでいます。">
        <vue-editor
          id="editor"
          v-model="claim_text"
        />
      </no-ssr>
    </v-card-text>
  </v-card>
</template>

<script>
export default {
  props: {
    claim_text_prop: String
  },
  data() {
    return {
      claim_text: `<h1 class="ql-align-center">プレースメントのための
スピーキングテスト(STAR)研究に関する実験協力サイト
</h1><p><br></p><p><br></p><p>本実験は、プレースメントのための日本語スピーキングテストSTAR(Speaking Test of Active Reaction)の開発に関連し、実験協力者に、日本語学習者の発話を判定していただくことで、STARの有用性を検証することを目的としています。</p><p><br></p><p>実験協力者に行っていただくことは、基本的に、１）日本語学習者の発話を判定する、２）判定の理由をコメントする、３）実験の事後アンケートに答える、の３つです。</p><p><br></p><p>実験への参加は任意であり、名前などの個人を特定する情報は公開されません。また、データ収集から２週間以内であれば、理由なしに協力を取りやめることができます。</p><p><br></p><p>実験協力の謝礼として、3000円の謝礼をお支払いします。所要時間は、1時間半〜２時間を見込んでいます。</p><p><br></p><p>本研究によって得られたデータは、部外秘として扱われ、録音や文字化、その他の個人情報は漏洩のないように致します。また、本研究の結果は、学会誌や研究発表、研究書出版などの学術研究発表にのみ、公開および利用されます。ただし、名前、所属など個人を特定するための情報は一切公開いたしません。なお、提供いただいたデータは、研究メンバーとして認められた者にのみ、利用されます。</p><p><br></p><p>また、本実験の内容に関して、ご不明な点がございましたら、下記の連絡先までお問い合わせいただきますよう、お願いいたします。</p><p><br></p><p>ボイクマン総子(Ph.D.)</p><p>東京大学 大学院総合文化研究科</p><p>グローバルコミュニケーション研究センター、教授</p><p>153-8902　東京都目黒区駒場3-8-1 東京大学</p><p>beuckmann@g.ecc.u-tokyo.ac.jp</p><p><br></p><p>
</p><h2 class="ql-align-center">ご承諾内容</h2><p>
下記の項目をお読みいただき、同意してくださる場合、□をクリックしてください。</p><p><br></p><ul><li>わたしは、この研究が、プレースメントのためのスピーキングテスト(STAR)研究の目的で行われること、その際、１）日本語学習者の発話を判定する、２）判定の理由をコメントする、３）実験の事後アンケートに答えることが求められることを理解しました。
</li></ul><p><br></p><ul><li>データ収集から２週間以内であれば、理由なしに協力を取りやめることができるということを理解しました。</li></ul><p><br></p><ul><li>わたしは、自分が提供したデータは部外秘として扱われ、漏洩がないよう注意が払われることを理解しました。</li></ul><p><br></p><ul><li>研究成果が公開されるときには、名前は伏せられ、個人が特定されるようなことがないことを理解しました。</li></ul><p><br></p><ul><li>録音、文字化などの本研究で得られた情報はボイクマン総子が保管すること、認められた研究メンバーだけがデータの利用が可能となることを理解しました。
</li></ul></div>`
    }
  },
  mounted() {
    if (this.claim_text_prop!==undefined) {
      this.claim_text = this.claim_text_prop
    }
  }
}
</script>